_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("ДатаЦены",Параметры.ДатаТекущихЦен);
	Список.Параметры.УстановитьЗначениеПараметра("СНБ",Параметры.РегиональнаяБаза);
	Список.Параметры.УстановитьЗначениеПараметра("Район",Параметры.Район);
	
	Если Параметры.Свойство("Проект") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Проект",Параметры.Проект);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Проект",Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка());
	КонецЕсли;
	
	Если Параметры.Свойство("Акт") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Акт",Параметры.Акт);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Акт",Документы.СМ_АктВыполненныхРабот.ПустаяСсылка());
	КонецЕсли;

	
	Если НЕ ЗначениеЗаполнено(Параметры.ДатаТекущихЦен) 
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.РегиональнаяБаза) 
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.Район) Тогда
		Элементы.БазиснаяЦена.Видимость = Ложь;
		Элементы.ТекущаяЦена.Видимость = Ложь;
		Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьСНБ",Ложь);
		Список.ТекстЗапроса = ТекстЗапросаБезЦен();
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьСНБ",Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ТекРесурс) Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекРесурс;
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.МножественныйВыбор = Ложь;
	КонецЕсли;

		
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаБезЦен()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СправочникСМ_Ресурсы.Ссылка,
	               |	СправочникСМ_Ресурсы.ПометкаУдаления,
	               |	СправочникСМ_Ресурсы.Родитель,
	               |	СправочникСМ_Ресурсы.ЭтоГруппа,
	               |	СправочникСМ_Ресурсы.Код,
	               |	СправочникСМ_Ресурсы.Наименование,
	               |	СправочникСМ_Ресурсы.ВидРесурса,
	               |	СправочникСМ_Ресурсы.ГодВыпуска,
	               |	ВЫБОР
	               |		КОГДА СправочникСМ_Ресурсы.ЭтоГруппа
	               |			ТОГДА СправочникСМ_Ресурсы.Наименование
	               |		ИНАЧЕ ВЫРАЗИТЬ(СправочникСМ_Ресурсы.ДлинноеНаименование КАК СТРОКА(500))
	               |	КОНЕЦ КАК ДлинноеНаименование,
	               |	СправочникСМ_Ресурсы.ЕдиницаИзмерения,
	               |	СправочникСМ_Ресурсы.КлассГруза,
	               |	СправочникСМ_Ресурсы.КодОКП,
	               |	СправочникСМ_Ресурсы.МассаБрутто,
	               |	СправочникСМ_Ресурсы.МассаНетто,
	               |	СправочникСМ_Ресурсы.ГруппаРесурсов,
	               |	СправочникСМ_Ресурсы.Предопределенный,
	               |	СправочникСМ_Ресурсы.ИмяПредопределенныхДанных,
	               |	СУММА(0) КАК БазиснаяЦена,
	               |	СУММА(0) КАК ТекущаяЦена
	               |ИЗ
	               |	Справочник.СМ_Ресурсы КАК СправочникСМ_Ресурсы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СправочникСМ_Ресурсы.Ссылка,
	               |	СправочникСМ_Ресурсы.ПометкаУдаления,
	               |	СправочникСМ_Ресурсы.Родитель,
	               |	СправочникСМ_Ресурсы.ЭтоГруппа,
	               |	СправочникСМ_Ресурсы.Код,
	               |	СправочникСМ_Ресурсы.Наименование,
	               |	СправочникСМ_Ресурсы.ВидРесурса,
	               |	СправочникСМ_Ресурсы.ГодВыпуска,
	               |	СправочникСМ_Ресурсы.ЕдиницаИзмерения,
	               |	СправочникСМ_Ресурсы.КлассГруза,
	               |	СправочникСМ_Ресурсы.КодОКП,
	               |	СправочникСМ_Ресурсы.МассаБрутто,
	               |	СправочникСМ_Ресурсы.МассаНетто,
	               |	СправочникСМ_Ресурсы.ГруппаРесурсов,
	               |	СправочникСМ_Ресурсы.Предопределенный,
	               |	СправочникСМ_Ресурсы.ИмяПредопределенныхДанных,
	               |	ВЫБОР
	               |		КОГДА СправочникСМ_Ресурсы.ЭтоГруппа
	               |			ТОГДА СправочникСМ_Ресурсы.Наименование
	               |		ИНАЧЕ ВЫРАЗИТЬ(СправочникСМ_Ресурсы.ДлинноеНаименование КАК СТРОКА(500))
	               |	КОНЕЦ";
	Возврат ТекстЗапроса;	
КонецФункции
#КонецОбласти
